[
  {
    "flowTalkAuthor": "jamieatsrice",
    "flowTalkTitle": "Birth Control OKAY?",
    "flowTalkText": "Ever since I started on birth control (Nexplanon, the arm implant), I have been getting my period once every two months. Do you think this will affect my body chemistry and have future damage on my female parts?",
    "createdAt": "01/28/2022 23:26",
    "comment": [
      {
        "commentText": "interacting so i can know the answer too",
        "commentAuthor": "annielnguyen",
        "createdAt": "01/28/2022 23:36"
      },
      {
        "commentText": "I've heard of people who just stopped getting their periods completely on the implant, its too scary for me to try",
        "commentAuthor": "jlee3883",
        "createdAt": "01/28/2022 23:45"
      },
      {
        "commentText": "I dont think anyone really knows the long term affects of birth control due to the lack of experimentation on women and women of color :/ sorry",
        "commentAuthor": "elmiratash",
        "createdAt": "01/28/2022 23:50"
      }
    ]
  },
  {
    "flowTalkAuthor": "jlee3883",
    "flowTalkTitle": "Here We Go Again",
    "flowTalkText": "I hate the start of the cycle. As expected, the worst of the cramps, bloating and tenderness have begun and the only comfort that eases it all is the ball I curl up into. The fetal position seems to govern my every move at this point. Gunna try to sleep it away.",
    "createdAt": "01/28/2022 23:34",
    "comment": [
      {
        "commentText": "My favorite thing is my huggable. It's a stuffed animal that you can microwave and use as a heat pack! It's helped so much. Also my mom reccommends ginseng tea",
        "commentAuthor": "jamieatsrice",
        "createdAt": "01/28/2022 23:40"
      },
      {
        "commentText": "just suck it up like the rest of us",
        "commentAuthor": "annielnguyen",
        "createdAt": "01/28/2022 23:45"
      },
      {
        "commentText": "If the pain is that bad, it is probably a good idea to check with a gyno. I would suggest a woman gyno, because there have been a lot of cases of sus men gynos out there",
        "commentAuthor": "elmiratash",
        "createdAt": "01/28/2022 23:43"
      }
    ]
  },
  {
    "flowTalkAuthor": "annielnguyen",
    "flowTalkTitle": "First Cycle with the Pill",
    "flowTalkText": "Since starting the pill, I noticed that my flow has been lighter. Cramps are not as bad as they used to be.  My acne has improved, but I've noticed that I've gained some weight. Overall, I'm feeling good today.",
    "createdAt": "01/31/2022 10:05",
    "comment": [
      {
        "commentText": "Do you reccomend the pill over other forms of contraceptives?",
        "commentAuthor": "jlee3883",
        "createdAt": "01/31/2022 10:10"
      },
      {
        "commentText": "I don't take the pill because I'm afraid to gain weight, realistically I haven't been using anything and just pushing my luck",
        "commentAuthor": "jamieatsrice",
        "createdAt": "01/31/2022 10:13"
      },
      {
        "commentText": "I'm glad the pill is working out for you!",
        "commentAuthor": "elmiratash",
        "createdAt": "01/31/2022 10:23"
      }
    ]
  },
  {
    "flowTalkAuthor": "elmiratash",
    "flowTalkTitle": "Feeling OK Today",
    "flowTalkText": "Today I had some bad cramps in the morning but it wasn't consistent. It was here and there. I was craving chocolate all day so I was happy that my husband brought me some after he got out of work. I was able to workout today despite the cramps throughout the day. It didn't prevent me from doing daily tasks like other days.",
    "createdAt": "01/31/2022 10:30",
    "comment": [
      {
        "commentText": "I'm so happy that u have someone to take care of you when you are in pain! Try a heating pad too!",
        "commentAuthor": "annielnguyen",
        "createdAt": "01/31/2022 10:33"
      },
      {
        "commentText": "awww im so jealous",
        "commentAuthor": "jamieatsrice",
        "createdAt": "01/31/2022 10:40"
      },
      {
        "commentText": "wow i wish i had chocolate on speed dial",
        "commentAuthor": "jlee3883",
        "createdAt": "01/31/2022 10:42"
      }
    ]
  }
]
