[
  {
    "flowTalkAuthor": "jamieatsrice",
    "flowTalkTitle": "Birth Control Affecting Period",
    "flowTalkText": "Ever since I started on birth control (Nexplanon, the arm implant), I have been getting my period once every two months. Do you think this will affect my body chemistry and have future damage on my female parts?",
    "createdAt": "01/28/2022 23:26",
    "comment": [
      {
        "text": "interacting so i can know the answer too",
        "author": "annielnguyen",
        "createdAt": "01/28/2022 23:36"
      },
      {
        "text": "I've heard of people who just stopped getting their periods completely on the implant, its too scary for me to try",
        "author": "jlee3883",
        "createdAt": "01/28/2022 23:45"
      },
      {
        "text": "I dont think anyone really knows the long term affects of birth control due to the lack of experimentation on women and women of color :/ sorry",
        "author": "elmiratash",
        "createdAt": "01/28/2022 23:50"
      }
    ]
  },
  {
    "flowTalkAuthor": "jlee3883",
    "flowTalkTitle": "Here We Go Again",
    "flowTalkText": "I hate the start of the cycle. As expected, the worst of the cramps, bloating and tenderness have begun and the only comfort that eases it all is the ball I curl up into. The fetal position seems to govern my every move at this point. Gunna try to sleep it away.",
    "createdAt": "01/28/2022 23:34",
    "comment": [
      {
        "text": "My favorite thing is my huggable. It's a stuffed animal that you can microwave and use as a heat pack! It's helped so much. Also my mom reccommends ginseng tea",
        "author": "jamieatsrice",
        "createdAt": "01/28/2022 23:40"
      },
      {
        "text": "just suck it up like the rest of us",
        "author": "annielnguyen",
        "createdAt": "01/28/2022 23:45"
      },
      {
        "text": "If the pain is that bad, it is probably a good idea to check with a gyno. I would suggest a woman gyno, because there have been a lot of cases of sus men gynos out there",
        "author": "elmiratash",
        "createdAt": "01/28/2022 23:43"
      }
    ]
  }
]
